In [1]:
# author = @sajjad hossain

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("TITANIC.csv")

In [4]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,0
1305,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,1
1306,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,0
1307,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,0
1308,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,0

In [5]:
df.shape

(1309, 12)

##MAKE A naive assumption that features such as male, class, age, cabin, fare, etc are independent of each other

In [6]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis ='columns', inplace=True)

In [7]:
df.head(15)

    Pclass     Sex   Age     Fare  Survived
0        3    male  22.0   7.2500         0
1        1  female  38.0  71.2833         1
2        3  female  26.0   7.9250         1
3        1  female  35.0  53.1000         1
4        3    male  35.0   8.0500         0
5        3    male   NaN   8.4583         0
6        1    male  54.0  51.8625         0
7        3    male   2.0  21.0750         0
8        3  female  27.0  11.1333         1
9        2  female  14.0  30.0708         1
10       3  female   4.0  16.7000         1
11       1  female  58.0  26.5500         1
12       3    male  20.0   8.0500         0
13       3    male  39.0  31.2750         0
14       3  female  14.0   7.8542         0

In [8]:
inputs = df.drop('Survived', axis = 'columns')
target = df.Survived

##NOW WE NEED TO CONVERT CATEGORICAL VALUES INTO NUMERICAL VALUE

In [9]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [10]:
inputs=pd.concat([inputs,dummies], axis= 'columns')

In [11]:
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [12]:
#NOW WE WILL DROP 'Sex', &'male' columns bcz only female column is enough to undrstange whether the person is male or female as in this column 1 is female and 0 is male

In [13]:
inputs.drop(['Sex','male'], axis ='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [14]:
#now we will check whether is there any null value

In [15]:
inputs.columns[inputs.isna().any()]

Index(['Age', 'Fare'], dtype='object')

In [16]:
inputs.Age[:30]

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5      NaN
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
15    55.0
16     2.0
17     NaN
18    31.0
19     NaN
20    35.0
21    34.0
22    15.0
23    28.0
24     8.0
25    38.0
26     NaN
27    19.0
28     NaN
29     NaN
Name: Age, dtype: float64

In [17]:
inputs.Fare[:30]

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
5       8.4583
6      51.8625
7      21.0750
8      11.1333
9      30.0708
10     16.7000
11     26.5500
12      8.0500
13     31.2750
14      7.8542
15     16.0000
16     29.1250
17     13.0000
18     18.0000
19      7.2250
20     26.0000
21     13.0000
22      8.0292
23     35.5000
24     21.0750
25     31.3875
26      7.2250
27    263.0000
28      7.8792
29      7.8958
Name: Fare, dtype: float64

In [18]:
#Now we need to fill the null valus, here we will use the mean approach to fill those null valus

In [19]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [20]:
inputs.columns[inputs.isna().any()]

Index(['Fare'], dtype='object')

In [21]:
inputs.Fare = inputs.Fare.fillna(inputs.Fare.mean())

In [22]:
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [23]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [24]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.30)

In [25]:
len(X_train)

916

In [26]:
len(X_test)

393

In [27]:
len(inputs)

1309

In [28]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [29]:
model.fit(X_train, y_train)

GaussianNB()

In [30]:
model.score(X_test, y_test)

0.8600508905852418

In [31]:
X_test[:15]

      Pclass        Age     Fare  female
953        3  18.000000   7.7500       0
400        3  39.000000   7.9250       0
573        3  29.881138   7.7500       1
468        3  29.881138   7.7250       0
475        1  29.881138  52.0000       0
1027       3  26.500000   7.2250       0
664        3  20.000000   7.9250       0
922        2  24.000000  31.5000       0
941        1  24.000000  60.0000       0
479        3   2.000000  12.2875       1
343        2  25.000000  13.0000       0
288        2  42.000000  13.0000       0
354        3  29.881138   7.2250       0
501        3  21.000000   7.7500       1
370        1  25.000000  55.4417       0

In [32]:
y_test[:15]

953     0
400     1
573     1
468     0
475     0
1027    0
664     1
922     0
941     0
479     1
343     0
288     1
354     0
501     0
370     1
Name: Survived, dtype: int64